import classes


def guidelines(self):
    '''
    Το πρόγραμμα αποτελεί την υλοποίηση του παιχνιδιού Scrabble. Αποτελείται από το αρχείο "main", το οποίο παρουσιάζει
    στον παίκτη το κεντρικό μενού και καλεί τις διάφορες λειτουργίες, και από το αρχείο "classes", που περιέχει τις
    κλάσεις που χρησιμοποιήθηκαν για το πρόγραμμα.

    Α) Κλάσεις:
        Για την εκτέλεση του παιχνιδιού χρησιμοποιούνται οι κλάσεις:

        i) SakClass: λειτουργεί ως το σακουλάκι με τα διαθέσιμα γράμματα και τις αξίες του καθενός. Η SakClass
        περιέχει την συναρτήση get_letters με την οποία δίνει τον αριθμό των γραμμάτων που χρειάζεται ένας παίκτης,
        την randomize_sak που ανακατεύει τα γράμματα στο σακουλάκι, την put_back που επανατοποθετεί τα γράμματα που δεν
        χρησιμοποίησε ο παίκτης και την check_empty που ελέγχει αν έχει αδειάσει το σακουλάκι.

        ii) Player: βασική κλάση την οποία κληρονομούν οι κλάσεις Human και Computer. Η Player περιέχει πληροφορίες,
        όπως το όνομα του παίκτη, τους πόντους του, τα γράμματα που έχει στην διάθεση του σε κάθε γύρο, τον αριθμό των
        κινήσεων που έχει κάνει συνολικά και αν έχει επιλέξει να τερματίσει το παιχνίδι. Οι συναρτήσεις που περιέχονται
        στην Player είναι η fill_letters που καλεί την get_letters της SakClass για να αντικαταστήσει τα γράμματα που
        λείπουν, η discard_letters που αντικαθιστά γράμματα σε περίπτωση που ο παίκτης το θελήσει, η
        remove_used_letters που αφαιρεί από την λίστα round_letters τα γράμματα που χρησιμοποιήθηκαν στην λέξη που
        παίχτηκε σε έναν γύρο, η check_letters για να ελεγχθεί αν η λέξη που πληκτρολόγησε ο παίκτης περιέχει τα
        γράμματα που έχει στην διάθεση του και οι getters για τις μεταβλητές της Player.

        iii) Human: κλάση παραγωγός της Player για το παιχνίδι του χρήστη. Περιέχει αποκλειστικά την συνάρτηση play, η
        οποία υλοποιεί έναν γύρο του παίκτη. Η συνάρτηση έλεγχει αρχικά αν υπάρχουν αρκετά γράμματα για να γεμίσει
        τα διαθέσιμα γράμματα του χρήστη, τα εμφανίζει εφόσον είναι εφικτό και στην συνέχεια αφήνει τον παίκτη να κάνει
        την επιλογή του.

        iv) Computer: κλάση παραγωγός της Player για το παιχνίδι του υπολογιστή. Περιέχει αποκλειστικά την συνάρτηση
        play, η οποία υλοποιεί έναν γύρο του υπολογιστή. Η συνάρτηση ελέγχει αρχικά αν υπάρχουν αρκετά γράμματα για να
        γεμίσει τα διαθέσιμα γράμματα του υπολογιστή, τα εμφανίζει εφόσον είναι εφικτό και στην συνέχεια εκτελεί τον
        κώδικα που αντιστοιχεί στο σενάριο που έχει επιλεχθεί.

        v) Game: κλάση που περιγράφει την υλοποίηση μίας παρτίδας. Η Game είναι η κλάση που καλείται από την main
        προκειμένου να πραγματοποιηθούν οι λειτουργίες του προγράμματος. Αυτές περιλαμβάνουν την εμφάνιση του
        σκορ/στατιστικών, την ρύθμιση του αλγόριθμου play που θα χρησιμοποιηθεί από τον υπολογιστή και την εκτέλεση μίας
        παρτίδας. Το παιχνίδι έχει ως προκαθορισμένη ρύθμιση την λειτουργία SMART για το Computer. Η κλάση αρχικοποιεί
        ένα αντικείμενο της Catalog και ένα της Statistics την πρώτη φορά που καλείται ο constructor της, ενώ υπάρχει
        και ένας τεχνητός constructor με το όνομα round_init για την αρχικοποίηση των αντικειμένων SakClass, Human και
        Computer με κάθε νέα παρτίδα που παίζεται, προκειμένου να μηδενίζονται οι μεταβλήτες που περιέχουν το σκορ του
        κάθε παιχνιδιού και να ξαναγεμίζει το σακούλι με τα γράμματα. Οι συναρτήσεις settings και game_stats υλοποιούν
        με την κατάλληλη μορφοποίηση το μενού των ρυθμίσεων και των στατιστικών αντίστοιχα. Τέλος, η run είναι η
        συνάρτηση που επιβλέπει την εκτέλεση της παρτίδας του Scrabble. Ένας βρόχος εκτελεί συνεχώς τους γύρους του
        παίκτη και του υπολογιστή έως ότου κάποιος από τους δύο να δηλώσει ότι δεν μπορεί να συνεχίσει (δεν μπορούν να
        αντικατασταθούν τα γράμματα τους ή ο υπολογιστής δεν μπορεί να βρει άλλη λέξη ή ο παίκτης επέλεξε να
        σταματήσει). Όταν η παρτίδα φτάσει στο τέλος της εμφανίζεται στην οθόνη η τελική βαθμολογία και ο νικητής του
        παιχνιδιού, ενώ αποθηκεύεται και το σκορ στο αρχείο.

        vi) Catalog: κλάση που δημιουργεί το λεξικό με τις διαθέσιμες λέξεις του παιχνιδιού μέσω
        της συνάρτησης create_catalog και υπολογίζει τους πόντους τους μέσω της word_points. Διαθέτει επιπλέον την
        συνάρτηση check_word η οποία ελέγχει αν μία λέξη υπάρχει στο λεξικό.

        vii) Statistics: κλάση που διαχειρίζεται τα στατιστικά του παιχνιδιού. Με την συνάρτηση read_file διαβάζει το
        αρχείο "statistics.txt" και αποθηκεύει το περιεχόμενο του στην λίστα stats για να εμφανιστούν στην συνέχεια με
        τον κατάλληλο τρόπο τα στοιχεία των προηγούμενων παρτίδων. Η write_file αποθηκεύει στο αρχείο τα στατιστικά μίας
        παρτίδας μετά το πέρας της.

    Β) Λεξικό:
        Για την αποθήκευση των λέξεων προτιμήθηκε η χρήση ενός λεξικού. Με αυτόν τον τρόπο, οι λέξεις μπορούν να
        αποθηκεύονται χρησιμοποιώντας την λέξη ως κλειδί (key) και την αξία της σε πόντους ως τιμή (value). Επιπλέον, η
        αναζήτηση μίας λέξης στην λίστα είναι άμεση, σε αντίθεση με την αναζήτησε σε λίστα, όπου θα πρέπει να γίνει
        ανάγνωση διαφόρων στοιχείων μέχρι να βρεθεί η λέξη που θέλουμε.

    Γ) Αλγόριθμος play:
        Ο αλγόριθμος που υλοποιήθηκε για το play του Computer είναι ο MIN-MAX-SMART. Για την επιλογή MIN ο υπολογιστής
        ξεκινά να κάνει μεταθέσεις από 2 γράμματα και τις αποθηκεύει στην λίστα word_list. Στην συνέχεια, γίνεται
        ανάγνωση της λίστα έως ότου βρει μία αποδεκτή λέξη, ενώ σε περίπτωση αποτυχίας προχωράει σε μεγαλύτερο αριθμό
        γραμμάτων μέχρι να φτάσει στα 7. Η επιλογή MAX λειτουργεί με αντίστοιχο τρόπο, με την μόνη διαφορά να είναι ότι
        οι πιθανές μεταθέσεις ξεκινούν από 7 γράμματα και ο αριθμός των γραμμάτων μειώνεται όσο δεν βρίσκεται μία
        αποδεκτή λέξη. Στην περίπτωση του SMART ελέγχονται όλοι οι πιθανοί συνδυασμοί από 2 έως 7 γράμματα και
        αποθηκεύεται η λέξη με την μεγαλύτερη αξία για να παιχτεί στην συνέχεια από τον υπολογιστή.

    Δ) Αρχεία:
        Τα απαραίτητα αρχεία για την σωστή λειτουργία του προγράμματος είναι τα "main-2800.py" και "classes.py" που
        περιέχουν τον κώδικα του προγράμματος, καθώς και το αρχείο "greek7.txt" που περιέχει τις αποδεκτές λέξεις του
        παιχνιδιού.
    '''


game = classes.Game()

while True:
    
    print("***** SCRABBLE *****")
    print("---------------------")
    print("1: Σκορ")
    print("2: Ρυθμίσεις")
    print("3: Παιχνίδι")
    print("q: Έξοδος")
    print("---------------------")

    choice = input("Επιλογή: ")

    if choice == '1':

        game.game_stats()

    elif choice == '2':

        game.settings()

    elif choice == '3':

        name = input("Δώσε το όνομα σου: ")
        game.round_init(name)
        game.run()
        game.end()

    elif choice == 'q':

        print("---------------------")
        print("Τα λέμε!")
        print("---------------------")
        break

    elif choice == 'help(guidelines)':

        help(guidelines)

    else:

        print("---------------------")
        print("Μη αναγνωρίσιμη επιλογή, παρακαλώ επιλέξτε ξανά.")
        print("---------------------")